{
  "_name_or_path": "gpt2",
  "activation_function": "gelu_new",
  "affines": true,
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "attn_drop": 0.1,
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "compression_rate": 2,
  "compressive": false,
  "continuous": true,
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "gradient_checkpointing": false,
  "infinite_memory": true,
  "initializer_range": 0.02,
  "kl_regularizer": true,
  "layer_norm_epsilon": 1e-05,
  "long_term_attention": true,
  "long_term_attention_basis": 512,
  "long_term_attention_norm": "softmax",
  "mask": true,
  "mask_dropout": 0,
  "mask_type": "cnn",
  "model_type": "gpt2",
  "mu_0": -1,
  "n_ctx": 1024,
  "n_embd": 768,
  "n_head": 12,
  "n_inner": null,
  "n_layer": 12,
  "n_positions": 1024,
  "n_special": 0,
  "predict_special_tokens": true,
  "resid_pdrop": 0.1,
  "sigma_0": 0.05,
  "sticky_memories": false,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 50
    }
  },
  "transformers_version": "4.5.0.dev0",
  "use_cache": true,
  "vocab_size": 50257
}

